{
  "name": "java",
  "notes": "Our own collected Java dataset from GitHub",
  "n_gpu": 1,
  "arch": {
    "file": "pytorch.model.seq2seq.packed_and_attention",
    "class_name": "Model",
    "packed": true,
    "args": {
      "input_dim": 30854,
      "output_dim": 13871,
      "enc_emb_dim": 256,
      "dec_emb_dim": 256,
      "enc_hid_dim": 512,
      "dec_hid_dim": 512,
      "enc_dropout": 0.1,
      "dec_dropout": 0.1
    }
  },
  "data_loader": {
    "file": "pytorch.data_loader.diff_loader",
    "class_name": "DiffLoader",
    "iterator": true,
    "args": {
      "data_dir": "data/Top1000-Java/",
      "file_path": "data/Top1000-Java/java-top-1000.processed.short",
      "packed": true,
      "split_ratio": [
        0.8,
        0.1,
        0.1
      ],
      "vocab_max_sizes": [
        50000,
        17000
      ],
      "vocab_min_freqs": [
        1,
        1
      ],
      "batch_sizes": [
        64,
        64,
        1
      ]
    }
  },
  "optimizer": {
    "type": "SGD",
    "args": {
      "lr": 0.1
    }
  },
  "loss": {
    "function": "cross_entropy",
    "padding_idx": true
  },
  "metrics": [],
  "lr_scheduler": {
    "type": "ReduceLROnPlateau",
    "args": {
      "factor": 0.1,
      "patience": 10
    }
  },
  "trainer": {
    "epochs": 500,
    "save_dir": "saved/",
    "save_period": 1,
    "verbosity": 2,
    "monitor": "min val_loss",
    "early_stop": 20,
    "tensorboard": true
  },
  "inference": {
    "src_file": "data/Top1000-Java/test.diff",
    "trg_file": "data/Top1000-Java/test.msg",
    "pred_file": "data/Top1000-Java/test.pred"
  }
}
