{
  "name": "NMT1",
  "notes": "NMT1 dataset from jiang et al.",
  "n_gpu": 1,
  "arch": {
    "file": "pytorch.model.seq2seq.packed_and_attention",
    "class_name": "Model",
    "packed": true,
    "args": {
      "input_dim": 30827,
      "output_dim": 5593,
      "enc_emb_dim": 256,
      "dec_emb_dim": 256,
      "enc_hid_dim": 512,
      "dec_hid_dim": 512,
      "enc_dropout": 0.1,
      "dec_dropout": 0.1
    }
  },
  "data_loader": {
    "file": "pytorch.data_loader.nmt1_loader",
    "class_name": "NMT1Loader",
    "iterator": true,
    "args": {
      "data_dir": "data/NMT1/",
      "packed": true,
      "vocab_max_sizes": [
        50000,
        17000
      ],
      "vocab_min_freqs": [
        2,
        2
      ],
      "batch_sizes": [
        64,
        64,
        64
      ]
    }
  },
  "optimizer": {
    "type": "SGD",
    "args": {
      "lr": 0.1
    }
  },
  "loss": {
    "function": "cross_entropy",
    "padding_idx": true
  },
  "metrics": [],
  "lr_scheduler": {
    "type": "ReduceLROnPlateau",
    "args": {
      "factor": 0.1,
      "patience": 10
    }
  },
  "trainer": {
    "epochs": 500,
    "save_dir": "saved/",
    "save_period": 1,
    "verbosity": 2,
    "monitor": "min val_loss",
    "early_stop": 20,
    "tensorboard": true
  },
  "inference": {
    "src_file": "NMT1/TestingSet/test.3000.diff",
    "trg_file": "NMT1/TestingSet/test.3000.msg",
    "pred_file": "NMT1/TestingSet/test.3000.pred"
  }
}
